[
  {
    "symbol": "H",
    "name": "Hydrogen",
    "info": "Atomic Number: 1. Lightest element, colorless gas, used in rocket fuel and the Sun's fusion."
  },
  {
    "symbol": "Li",
    "name": "Lithium",
    "info": "Atomic Number: 3. Soft metal, used in rechargeable batteries."
  },
  {
    "symbol": "Na",
    "name": "Sodium",
    "info": "Atomic Number: 11. Soft, silvery metal, highly reactive with water, used in table salt."
  },
  {
    "symbol": "K",
    "name": "Potassium",
    "info": "Atomic Number: 19. Soft, silvery metal, essential for life, used in fertilizers."
  },
  {
    "symbol": "Rb",
    "name": "Rubidium",
    "info": "Atomic Number: 37. Soft, silvery-white metallic element, highly reactive."
  },
  {
    "symbol": "Cs",
    "name": "Caesium",
    "info": "Atomic Number: 55. Soft, gold-colored metal, used in atomic clocks."
  },
  {
    "symbol": "Fr",
    "name": "Francium",
    "info": "Atomic Number: 87. Extremely rare and radioactive alkali metal."
  },
  {
    "symbol": "Be",
    "name": "Beryllium",
    "info": "Atomic Number: 4. Strong, lightweight metal, used in aerospace and military applications."
  },
  {
    "symbol": "Mg",
    "name": "Magnesium",
    "info": "Atomic Number: 12. Lightweight metal, used in alloys and fireworks."
  },
  {
    "symbol": "Ca",
    "name": "Calcium",
    "info": "Atomic Number: 20. Essential for bones and teeth, used in cement and lime."
  },
  {
    "symbol": "Sr",
    "name": "Strontium",
    "info": "Atomic Number: 38. Soft, silvery metal, used in fireworks and magnets."
  },
  {
    "symbol": "Ba",
    "name": "Barium",
    "info": "Atomic Number: 56. Soft, silvery metal, used in X-ray imaging."
  },
  {
    "symbol": "Ra",
    "name": "Radium",
    "info": "Atomic Number: 88. Radioactive, used in luminous paints (historically)."
  },
  {
    "symbol": "Cr",
    "name": "Chromium",
    "info": "Atomic Number: 24. Used in stainless steel and chrome plating."
  },
  {
    "symbol": "Mn",
    "name": "Manganese",
    "info": "Atomic Number: 25. Used in steel production and batteries."
  },
  {
    "symbol": "Fe",
    "name": "Iron",
    "info": "Atomic Number: 26. Used in construction, machinery, and is essential for blood (hemoglobin)."
  },
  {
    "symbol": "Co",
    "name": "Cobalt",
    "info": "Atomic Number: 27. Used in magnets, batteries, and blue pigments."
  },
  {
    "symbol": "Ni",
    "name": "Nickel",
    "info": "Atomic Number: 28. Used in coins, stainless steel, and batteries."
  },
  {
    "symbol": "Cu",
    "name": "Copper",
    "info": "Atomic Number: 29. Excellent conductor, used in electrical wiring and coins."
  },
  {
    "symbol": "Zn",
    "name": "Zinc",
    "info": "Atomic Number: 30. Used for galvanizing iron, in batteries, and as a dietary supplement."
  },
  {
    "symbol": "Ag",
    "name": "Silver",
    "info": "Atomic Number: 47. Precious metal, used in jewelry, coins, and electronics."
  },
  {
    "symbol": "Cd",
    "name": "Cadmium",
    "info": "Atomic Number: 48. Used in batteries and pigments, toxic heavy metal."
  },
  {
    "symbol": "Pt",
    "name": "Platinum",
    "info": "Atomic Number: 78. Precious metal, used in catalytic converters and jewelry."
  },
  {
    "symbol": "Au",
    "name": "Gold",
    "info": "Atomic Number: 79. Precious metal, used in jewelry, electronics, and as a standard for currency."
  },
  {
    "symbol": "Hg",
    "name": "Mercury",
    "info": "Atomic Number: 80. Only liquid metal at room temperature, used in thermometers and fluorescent lamps."
  },
  {
    "symbol": "Al",
    "name": "Aluminum",
    "info": "Atomic Number: 13. Lightweight, corrosion-resistant metal, used in cans and aircraft."
  },
  {
    "symbol": "Ga",
    "name": "Gallium",
    "info": "Atomic Number: 31. Melts in your hand, used in electronics and LEDs."
  },
  {
    "symbol": "C",
    "name": "Carbon",
    "info": "Atomic Number: 6. Fundamental building block of life, found in diamonds and graphite."
  },
  {
    "symbol": "N",
    "name": "Nitrogen",
    "info": "Atomic Number: 7. Colorless, odorless gas, makes up 78% of Earth's atmosphere."
  },
  {
    "symbol": "O",
    "name": "Oxygen",
    "info": "Atomic Number: 8. Essential for respiration, reactive element, supports combustion."
  },
  {
    "symbol": "P",
    "name": "Phosphorus",
    "info": "Atomic Number: 15. Essential for life, used in fertilizers and DNA."
  },
  {
    "symbol": "S",
    "name": "Sulfur",
    "info": "Atomic Number: 16. Yellow solid, used in fertilizers and gunpowder."
  },
  {
    "symbol": "Se",
    "name": "Selenium",
    "info": "Atomic Number: 34. Used in glassmaking and electronics, essential trace element."
  },
  {
    "symbol": "B",
    "name": "Boron",
    "info": "Atomic Number: 5. Metalloid, used in glass and ceramics, enhances strength and heat resistance."
  },
  {
    "symbol": "Si",
    "name": "Silicon",
    "info": "Atomic Number: 14. Semiconductor, used in electronics and solar cells."
  },
  {
    "symbol": "Ge",
    "name": "Germanium",
    "info": "Atomic Number: 32. Used in semiconductors and fiber optics."
  },
  {
    "symbol": "As",
    "name": "Arsenic",
    "info": "Atomic Number: 33. Poisonous metalloid, used in pesticides and semiconductors."
  },
  {
    "symbol": "Sb",
    "name": "Antimony",
    "info": "Atomic Number: 51. Used in flame retardants and alloys."
  },
  {
    "symbol": "Te",
    "name": "Tellurium",
    "info": "Atomic Number: 52. Used in alloys and solar panels."
  },
  {
    "symbol": "F",
    "name": "Fluorine",
    "info": "Atomic Number: 9. Highly reactive, used in toothpaste and Teflon."
  },
  {
    "symbol": "Cl",
    "name": "Chlorine",
    "info": "Atomic Number: 17. Greenish-yellow gas, used in disinfectants and bleach."
  },
  {
    "symbol": "Br",
    "name": "Bromine",
    "info": "Atomic Number: 35. Reddish-brown liquid, used in flame retardants."
  },
  {
    "symbol": "I",
    "name": "Iodine",
    "info": "Atomic Number: 53. Purple-black solid, essential for thyroid health."
  },
  {
    "symbol": "At",
    "name": "Astatine",
    "info": "Atomic Number: 85. Rare, radioactive halogen."
  },
  {
    "symbol": "He",
    "name": "Helium",
    "info": "Atomic Number: 2. Noble gas, inert, used in balloons and cooling superconducting magnets."
  },
  {
    "symbol": "Ne",
    "name": "Neon",
    "info": "Atomic Number: 10. Noble gas, emits red-orange glow, used in neon signs."
  },
  {
    "symbol": "Ar",
    "name": "Argon",
    "info": "Atomic Number: 18. Noble gas, inert, used in light bulbs and welding."
  },
  {
    "symbol": "Kr",
    "name": "Krypton",
    "info": "Atomic Number: 36. Noble gas, used in lighting and photography."
  },
  {
    "symbol": "Xe",
    "name": "Xenon",
    "info": "Atomic Number: 54. Noble gas, used in lamps and anesthesia."
  },
  {
    "symbol": "Rn",
    "name": "Radon",
    "info": "Atomic Number: 86. Radioactive noble gas, health hazard in homes."
  }
]
